test_new/multiphaseEuler/massDiffusionLimitedPhaseChange/waterAndIsopropanolEvaporation/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChange
{
    type            massDiffusionLimitedPhaseChange;
    libs            ("libmultiphaseEulerFvModels.so");

    phases          (gas liquid);

    energySemiImplicit yes;

    interfaceComposition
    {
        gas_liquid_inThe_gas
        {
            type            nonRandomTwoLiquid;
            species         (H2O C3H8O);
            Le              1.0;
            H2O
            {
                 alpha          0.3;
                 beta           0.0;
                 interaction
                 {
                     type           Antoine;
                     A              6.8284;
                     B              -1283.46;
                     C              0;
                 }
                 type           saturated;
                 species        (H2O);
                 Le             1.0;
                 pSat           ArdenBuck;
            }
            C3H8O
            {
                 alpha          0.3;
                 beta           0.0;
                 interaction
                 {
                     type           Antoine;
                     A              -1.3115;
                     B              426.398;
                     C              0;
                 }
                 type           saturated;
                 species        (C3H8O);
                 Le             1.0;
                 pSat
                 {
                     type           Antoine;
                     A              22.7057916;
                     B              -3125.59117503;
                     C              -75.814;
                 }
            }
        }
    }

    diffusiveMassTransfer
    {
        blending        default;

        liquid_dispersedIn_gas_inThe_gas
        {
            type            Frossling;
            Le              1.0;
        }
    }
}

// ************************************************************************* //
