test_new/multiphaseEuler/massDiffusionLimitedPhaseChange/waterAndIsopropanolEvaporation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (gas liquid);

gas
{
    type            multicomponentPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

liquid
{
    type            multicomponentPhaseModel;

    diameterModel
    {
        type            constant;
        d               5e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           gas;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.07;
    }
}

// ************************************************************************* //
